Autodesk.Revit.DB.Electrical.ConductorSize.GetConductorSizes(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.GetConductorSizeIdByName(Autodesk.Revit.DB.Document,System.String)
Gets the Conductor Size id by given Conductor Size name.
document:
The document.
name:
The Conductor Size name.
Returns:
The Conductor Size id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.GetConductorSizeIds(Autodesk.Revit.DB.Document)
Gets all the Conductor Size ids in the given document, sorted by name.
document:
The document.
Returns:
All the Conductor Size ids in this document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.GetConductorSize(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the Conductor Size data by given Conductor Size id.
document:
The document.
conductorSizeId:
The Conductor Size id.
Returns:
The Conductor Size data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The id is not a Conductor Size id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.Create(Autodesk.Revit.DB.Document)
Creates a Conductor Size.
document:
The document.
Returns:
The newly created Conductor Size data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ConductorSize.Name
The Conductor Size name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: name is not unique in document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.Id
The Conductor Size id.
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize.Diameter
The diameter of the conductor.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for diameter is not finite
-or-
When setting this property: The given value for diameter is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for diameter must be non-negative.
Since:
2026

Autodesk.Revit.DB.Electrical.ConductorSize
This class represents the definition of Conductor Size data.
Since:
2026